# Assignment 5: Hotswapping
Team members: Tyler Yang, Justin Su, Fnu Chaitanya

Example run (note that module name is hw5 in this example, just replace hw5 with main):

```erl
1> c(hw5).
{ok,hw5}
2> hw5:start().
Enter a command: rick.
Server1: Working...
Server2: Working...
Server3: Working...
Server3: Not Handled: rick
Enter a command: rick2.
Server1: Working...
Server2: Working...
Server3: Working...
Server3: Not Handled: rick2
Enter a command: rick3.
Server1: Working...
Server2: Working...
Server3: Working...
Server3: Not Handled: rick3
Enter a command: all_done.
ok
```

Then change the original file (uncomment rick, rick2, rick3)

```erl
3> c(hw5).
{ok,hw5}
4> whereis(server1)!update.
Server1: Updating...
update
5> whereis(server3)!update.
Server3: Updating...
update
6> hw5:start().
Enter a command: rick.
Server1: Never gonna give you up
Enter a command: rick2.
Server1: Working...
Server2: Working...
Server3: Working...
Server3: Not Handled: rick2
Enter a command: rick3.
Server1: Working...
Server2: Working...
Server3: Never gonna run around and desert you
```
